In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'category': pd.Series([1, 2, 3])})
df1.head()

   category
0         1
1         2
2         3

In [3]:
pd.DataFrame([1, 2, 3], columns=['category'])

   category
0         1
1         2
2         3

In [4]:
pd.DataFrame.from_dict({'category': [1, 2, 3]})

   category
0         1
1         2
2         3

In [5]:
pd.DataFrame(pd.Series([1,2,3]), columns=["category"])

   category
0         1
1         2
2         3

In [6]:
import copy

In [7]:
df = copy.deepcopy(df1)
df.head()

   category
0         1
1         2
2         3

In [8]:
df['cities'] = pd.Series([['Delhi', 'Mumbai'], ['Lucknow', 'Bhopal'], ['Chennai', 'Bangalore']])

In [9]:
df.head()

   category                cities
0         1       [Delhi, Mumbai]
1         2     [Lucknow, Bhopal]
2         3  [Chennai, Bangalore]

In [10]:
df = df.assign(
    adult_viewers = pd.Series([2500000, 3500000, 1600000]),
    aged_viewers = pd.Series([2300000, 2800000, 2000000]),
    young_viewers = pd.Series([2000000, 3000000, 1500000]),
)

In [11]:
df

   category                cities  adult_viewers  aged_viewers  young_viewers
0         1       [Delhi, Mumbai]        2500000       2300000        2000000
1         2     [Lucknow, Bhopal]        3500000       2800000        3000000
2         3  [Chennai, Bangalore]        1600000       2000000        1500000

In [12]:
df.append(pd.DataFrame([[['Kolkata', 'Hyderabad'], 2000000, 2000000,1500000]], 
                       columns=[ 'cities', 'adult_viewers', 
                                'aged_viewers', 'young_viewers']))

/home/poseidon/.local/lib/python2.7/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

   adult_viewers  aged_viewers  category                cities  young_viewers
0        2500000       2300000       1.0       [Delhi, Mumbai]        2000000
1        3500000       2800000       2.0     [Lucknow, Bhopal]        3000000
2        1600000       2000000       3.0  [Chennai, Bangalore]        1500000
0        2000000       2000000       NaN  [Kolkata, Hyderabad]        1500000

In [13]:
df = df.append({'cities': ["Kolkata", "Hyderabad"], 'adult_viewers': 2000000, 
                'aged_viewers': 2000000, 'young_viewers': 1500000}, ignore_index = True)
df.head()

   category                cities  adult_viewers  aged_viewers  young_viewers
0       1.0       [Delhi, Mumbai]        2500000       2300000        2000000
1       2.0     [Lucknow, Bhopal]        3500000       2800000        3000000
2       3.0  [Chennai, Bangalore]        1600000       2000000        1500000
3       NaN  [Kolkata, Hyderabad]        2000000       2000000        1500000

In [14]:
pd.concat([df, pd.DataFrame([[4, ['Kolkata', 'Hyderabad'], 2000000, 2000000,1500000]], 
                       columns=['category', 'cities', 'adult_viewers', 
                                'aged_viewers', 'young_viewers'])])

   category                cities  adult_viewers  aged_viewers  young_viewers
0       1.0       [Delhi, Mumbai]        2500000       2300000        2000000
1       2.0     [Lucknow, Bhopal]        3500000       2800000        3000000
2       3.0  [Chennai, Bangalore]        1600000       2000000        1500000
3       NaN  [Kolkata, Hyderabad]        2000000       2000000        1500000
0       4.0  [Kolkata, Hyderabad]        2000000       2000000        1500000

In [15]:
df.drop([3])

   category                cities  adult_viewers  aged_viewers  young_viewers
0       1.0       [Delhi, Mumbai]        2500000       2300000        2000000
1       2.0     [Lucknow, Bhopal]        3500000       2800000        3000000
2       3.0  [Chennai, Bangalore]        1600000       2000000        1500000

In [16]:
df.drop('category', axis = 1)

                 cities  adult_viewers  aged_viewers  young_viewers
0       [Delhi, Mumbai]        2500000       2300000        2000000
1     [Lucknow, Bhopal]        3500000       2800000        3000000
2  [Chennai, Bangalore]        1600000       2000000        1500000
3  [Kolkata, Hyderabad]        2000000       2000000        1500000

In [17]:
df['viewers'] = df['adult_viewers']+df['aged_viewers']+df['young_viewers']
df['expected clicks'] = 0.03*df['viewers']
df.head()

,category,cities,adult_viewers,aged_viewers,young_viewers,viewers,expected clicks
0,1.0,"[Delhi, Mumbai]",2500000,2300000,2000000,6800000,204000.0
1,2.0,"[Lucknow, Bhopal]",3500000,2800000,3000000,9300000,279000.0
2,3.0,"[Chennai, Bangalore]",1600000,2000000,1500000,5100000,153000.0
3,NaN,"[Kolkata, Hyderabad]",2000000,2000000,1500000,5500000,165000.0

In [18]:
df1

   category
0         1
1         2
2         3

In [19]:
pd.merge(df, df1, how = 'right')

,category,cities,adult_viewers,aged_viewers,young_viewers,viewers,expected clicks
0,1.0,"[Delhi, Mumbai]",2500000,2300000,2000000,6800000,204000.0
1,2.0,"[Lucknow, Bhopal]",3500000,2800000,3000000,9300000,279000.0
2,3.0,"[Chennai, Bangalore]",1600000,2000000,1500000,5100000,153000.0

In [20]:
df = pd.merge(df, df1, how = 'outer')

In [21]:
df.dropna()

,category,cities,adult_viewers,aged_viewers,young_viewers,viewers,expected clicks
0,1.0,"[Delhi, Mumbai]",2500000,2300000,2000000,6800000,204000.0
1,2.0,"[Lucknow, Bhopal]",3500000,2800000,3000000,9300000,279000.0
2,3.0,"[Chennai, Bangalore]",1600000,2000000,1500000,5100000,153000.0

In [22]:
df.fillna(-1)

,category,cities,adult_viewers,aged_viewers,young_viewers,viewers,expected clicks
0,1.0,"[Delhi, Mumbai]",2500000,2300000,2000000,6800000,204000.0
1,2.0,"[Lucknow, Bhopal]",3500000,2800000,3000000,9300000,279000.0
2,3.0,"[Chennai, Bangalore]",1600000,2000000,1500000,5100000,153000.0
3,-1.0,"[Kolkata, Hyderabad]",2000000,2000000,1500000,5500000,165000.0

In [23]:
df.fillna(99999999)

,category,cities,adult_viewers,aged_viewers,young_viewers,viewers,expected clicks
0,1.0,"[Delhi, Mumbai]",2500000,2300000,2000000,6800000,204000.0
1,2.0,"[Lucknow, Bhopal]",3500000,2800000,3000000,9300000,279000.0
2,3.0,"[Chennai, Bangalore]",1600000,2000000,1500000,5100000,153000.0
3,99999999.0,"[Kolkata, Hyderabad]",2000000,2000000,1500000,5500000,165000.0

In [24]:
df.interpolate(method = 'krogh')

,category,cities,adult_viewers,aged_viewers,young_viewers,viewers,expected clicks
0,1.0,"[Delhi, Mumbai]",2500000,2300000,2000000,6800000,204000.0
1,2.0,"[Lucknow, Bhopal]",3500000,2800000,3000000,9300000,279000.0
2,3.0,"[Chennai, Bangalore]",1600000,2000000,1500000,5100000,153000.0
3,4.0,"[Kolkata, Hyderabad]",2000000,2000000,1500000,5500000,165000.0

In [25]:
for row in df.itertuples(index = False):
     print(row)

Pandas(category=1.0, cities=['Delhi', 'Mumbai'], adult_viewers=2500000, aged_viewers=2300000, young_viewers=2000000, viewers=6800000, _6=204000.0)
Pandas(category=2.0, cities=['Lucknow', 'Bhopal'], adult_viewers=3500000, aged_viewers=2800000, young_viewers=3000000, viewers=9300000, _6=279000.0)
Pandas(category=3.0, cities=['Chennai', 'Bangalore'], adult_viewers=1600000, aged_viewers=2000000, young_viewers=1500000, viewers=5100000, _6=153000.0)
Pandas(category=nan, cities=['Kolkata', 'Hyderabad'], adult_viewers=2000000, aged_viewers=2000000, young_viewers=1500000, viewers=5500000, _6=165000.0)

In [26]:
for row in df.itertuples(name = "Monthly"):
    print(row)

Monthly(Index=0, category=1.0, cities=['Delhi', 'Mumbai'], adult_viewers=2500000, aged_viewers=2300000, young_viewers=2000000, viewers=6800000, _7=204000.0)
Monthly(Index=1, category=2.0, cities=['Lucknow', 'Bhopal'], adult_viewers=3500000, aged_viewers=2800000, young_viewers=3000000, viewers=9300000, _7=279000.0)
Monthly(Index=2, category=3.0, cities=['Chennai', 'Bangalore'], adult_viewers=1600000, aged_viewers=2000000, young_viewers=1500000, viewers=5100000, _7=153000.0)
Monthly(Index=3, category=nan, cities=['Kolkata', 'Hyderabad'], adult_viewers=2000000, aged_viewers=2000000, young_viewers=1500000, viewers=5500000, _7=165000.0)

In [27]:
for label, content in df.iterrows():
    print(label, content['viewers'], getattr(content, 'expected clicks'))

(0, 6800000, 204000.0)
(1, 9300000, 279000.0)
(2, 5100000, 153000.0)
(3, 5500000, 165000.0)

In [28]:
for label, content in df.iteritems():
    print(label, content[2])

('category', 3.0)
('cities', ['Chennai', 'Bangalore'])
('adult_viewers', 1600000)
('aged_viewers', 2000000)
('young_viewers', 1500000)
('viewers', 5100000)
('expected clicks', 153000.0)

In [29]:
df.groupby('aged_viewers')['cities'].sum()

aged_viewers
2000000    [Chennai, Bangalore, Kolkata, Hyderabad]
2300000                             [Delhi, Mumbai]
2800000                           [Lucknow, Bhopal]
Name: cities, dtype: object